#2. შემოატანინეთ მომხარებელს სახელი გვარი და ასაკი და გამოიყენეთ ის წინადადებაში.
name = input("შეიყვანე შენი სახელი")
surname = input("შეიყვანე შენი გვარი")
age = input("შეიყვანე შენი ასაკი")
# შევიქმენით 3 ცვლადი რომელშიც უნდა შეიტანო სახელი,გვარი და ასაკი

#3. შემოატანინეთ მომხარებელს ორი რიცხვი და მოახდინეთ მათემატიკური გამოთვლები მათზე.

num1 = 16
num2 = 8

print(num1 + num2)
print(num1 - num2)
print(num1 * num2)
print(num1 / num2) 
# შევქმენით 2 ცვლადი და შევასრულეთ მათმატიკური გამოთვლები

#4.შემოატანინეთ მომხარებელს ემაილი და პაროლი და დაპრინტეთ ის.

gmail = input("gnebieridze83@gmail.com")
print(gmail)
# შვქმენით ემაილი და დავპრინტეთ