# 1. for loop გამოყენებით დაპრინტეთ რიცხვები 0-დან 100მდე.
# გამოიყენეთ continue statement რათა არ დაიპრინტოს 15,27,67,32,99,93.
for i in range(0,100):
    if i == 15:
        continue
    if i == 27:
        continue
    if i == 67:
        continue
    if i == 32:
        continue
    if i == 99:
        continue
    if i == 93:
        continue
    else:
        print(i)

# 2. while ციკლის მეშვეობით შედით უსასრულობის ციკლში.
#  ციკლის გარეთ შექმენით ცვლადი რომელიც უდრის 0-ს. ციკლში ამ ცვლადს დაუმატეთ ყოველ დატრიალებაზე 1 და როდესაც    ჩვენი    ცვლადი გახდება 23 შეწყვიტეთ ციკლი break მეშვეობით.
num = 0
while True:
     num += 1
     if num == 23:
         break
     print(num)

# 3. შექმენით სია და ჩაამატეთ 5 მონაცემი.
# append მეშვეობით სიის ბოლოში დაამატეთ 2 ახალი მონაცემი.
list = [1,2,3,4,5]
list.append(6)
list.append(7)
print(list)

# 4. შექმენით 2D მატრიცა სადაც მეორე სიიდან უნდა ამოიღოთ 3 პოზიციაზე მდგომი მონაცემი და დაპრინტოთ.
list=[[1,2,3,4]]
print(list[0][3])
