# 1. რიცხვების დაბეჭდვა 1-დან 5-მდე
# დაწერე პროგრამა, რომელიც while ციკლის გამოყენებით დაბეჭდავს რიცხვებს 1-დან 5-მდე.
count=1
while count < 5:
    print("count")
    count = count + 1
# 2. რიცხვების ჯამი 1-დან 10-მდე
# დაწერე პროგრამა, რომელიც while ციკლის გამოყენებით გამოთვლის და დაბეჭდავს რიცხვების ჯამს 1-დან 10-მდე.
age=0
for i in range(1,10):
    age = age + 1
    print(age)

#     3. მომხმარებლისგან რიცხვის შეყვანა
# დაწერე პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს რიცხვი და while ციკლის გამოყენებით დაბეჭდავს ამ რიცხვამდე ყველა მთელ რიცხვს.
num=int(input("enter your number"))
count=0
while count < num:
    print(count)
    count =count + 1

#     4. პაროლის შემოწმება
# დაწერე პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს პაროლი. თუ პაროლი არასწორია, განაგრძე კითხვა, სანამ არ შეიყვანს სწორ პაროლს (სწორი_პაროლი = "1234").