#1. შემოატანინეთ მომხმარებელს თავიანთი დაბადების წელი და გადააქციეთ integer-ად, ახსენით რატომ გააკეთეთ ეს
year = int(input("enter your birth year"))
print(year)
# იმტომ input_ში რაც შეგვაქ ყველაპერი არის str და int_ად რომ გადავაქციოთ
# 2) შემოატანინეთ მომხმარებელს username და დაპრინტეთ: "Hello, (მისი username) !"
username = input("enter your name")
print("hello " + username)
# 3) კომენტარებით ახსენით რა არის concatenation ( კონკატენაცია ) (from classwork)
# კონკატენაცია_ კონკატენაცია არის ორი ან მეტი str_ს მიმატება

# 4) ჩამოთვალეთ მონაცემთა ტიპები
# მონაცემთა ტიპებია : str, int და float

# 5) კომენტარებით ახსენით თუ რას აკეთებს type(), int() და str()  ფუნქციები
# tyoe_ ფუნქციაგვეუბნება ინფორმაციის ტიპს
# int_ გარდაქმნის რაღაც ინპორმაციას integer_ად
# str_  გარდაქმნის რაღაც ინფორმაციას string_ად 







